#+TITLE: SAAS Application with Gin - Plan of Action

***** Redis

#+begin_src sh
docker pull redis:6.0
#+end_src

#+RESULTS:
| 6.0:                        | Pulling                                                                 | from     | library/redis |     |           |
| e5ae68f74026:               | Pulling                                                                 | fs       | layer         |     |           |
| 37c4354629da:               | Pulling                                                                 | fs       | layer         |     |           |
| b065b1b1fa0f:               | Pulling                                                                 | fs       | layer         |     |           |
| a2b1e36a893a:               | Pulling                                                                 | fs       | layer         |     |           |
| 8fd753f9fab6:               | Pulling                                                                 | fs       | layer         |     |           |
| b3cb1ccc49b3:               | Pulling                                                                 | fs       | layer         |     |           |
| a2b1e36a893a:               | Waiting                                                                 |          |               |     |           |
| 8fd753f9fab6:               | Waiting                                                                 |          |               |     |           |
| b3cb1ccc49b3:               | Waiting                                                                 |          |               |     |           |
| 37c4354629da:               | Verifying                                                               | Checksum |               |     |           |
| 37c4354629da:               | Download                                                                | complete |               |     |           |
| b065b1b1fa0f:               | Verifying                                                               | Checksum |               |     |           |
| b065b1b1fa0f:               | Download                                                                | complete |               |     |           |
| 8fd753f9fab6:               | Verifying                                                               | Checksum |               |     |           |
| 8fd753f9fab6:               | Download                                                                | complete |               |     |           |
| a2b1e36a893a:               | Verifying                                                               | Checksum |               |     |           |
| a2b1e36a893a:               | Download                                                                | complete |               |     |           |
| e5ae68f74026:               | Download                                                                | complete |               |     |           |
| b3cb1ccc49b3:               | Verifying                                                               | Checksum |               |     |           |
| b3cb1ccc49b3:               | Download                                                                | complete |               |     |           |
| e5ae68f74026:               | Pull                                                                    | complete |               |     |           |
| 37c4354629da:               | Pull                                                                    | complete |               |     |           |
| b065b1b1fa0f:               | Pull                                                                    | complete |               |     |           |
| a2b1e36a893a:               | Pull                                                                    | complete |               |     |           |
| 8fd753f9fab6:               | Pull                                                                    | complete |               |     |           |
| b3cb1ccc49b3:               | Pull                                                                    | complete |               |     |           |
| Digest:                     | sha256:41db4b66944d7256fd5aa22ab2d320248ead5ed63bab4f5bd7ba6c3578a9bae9 |          |               |     |           |
| Status:                     | Downloaded                                                              | newer    | image         | for | redis:6.0 |
| docker.io/library/redis:6.0 |                                                                         |          |               |     |           |

https://hub.docker.com/_/redis

***** Review
Review docker images.

#+begin_src sh
docker images
#+end_src

#+RESULTS:
| REPOSITORY                  | TAG               | IMAGE        | ID | CREATED | SIZE |        |
| golang                      | 1.17              | 2e7da682bb63 |  5 | days    | ago  | 941MB  |
| redis                       | 6.0               | 62ef09cc79c5 |  6 | days    | ago  | 112MB  |
| kindest/node                | <none>            | 32b8b755dee8 |  6 | months  | ago  | 1.12GB |
| mongo                       | 4.4.3             | ca8e14b1fda6 | 10 | months  | ago  | 493MB  |

